[
  {
    "text": "<|user|>\nAnalyze this product review: Excellent product! Great quality and fast delivery. Highly recommend.\n<|assistant|>\nThis review shows very positive sentiment (0.90) with a 5/5 star rating."
  },
  {
    "text": "<|user|>\nWhat features does this review mention: Excellent product! Great quality and fast delivery. Highly recommend.\n<|assistant|>\nThe review mentions quality, delivery. Overall sentiment is very positive with 5/5 stars."
  },
  {
    "text": "<|user|>\nAnalyze this product review: Poor quality, broke after one week. Not worth the money.\n<|assistant|>\nThis review shows very negative sentiment (-0.80) with a 2/5 star rating."
  },
  {
    "text": "<|user|>\nWhat features does this review mention: Poor quality, broke after one week. Not worth the money.\n<|assistant|>\nThe review mentions quality, value. Overall sentiment is very negative with 2/5 stars."
  },
  {
    "text": "<|user|>\nAnalyze this product review: Good value for money. Works as expected but could be better.\n<|assistant|>\nThis review shows positive sentiment (0.20) with a 4/5 star rating."
  },
  {
    "text": "<|user|>\nWhat features does this review mention: Good value for money. Works as expected but could be better.\n<|assistant|>\nThe review mentions performance, value. Overall sentiment is positive with 4/5 stars."
  },
  {
    "text": "<|user|>\nAnalyze this product review: Amazing design and quality! Love the style and it works perfectly.\n<|assistant|>\nThis review shows very positive sentiment (0.70) with a 5/5 star rating."
  },
  {
    "text": "<|user|>\nWhat features does this review mention: Amazing design and quality! Love the style and it works perfectly.\n<|assistant|>\nThe review mentions quality, design. Overall sentiment is very positive with 5/5 stars."
  },
  {
    "text": "<|user|>\nAnalyze this product review: Average product. Nothing special but does the job.\n<|assistant|>\nThis review shows neutral sentiment (0.00) with a 3/5 star rating."
  },
  {
    "text": "<|user|>\nAnalyze this product review: Terrible customer service. Product is okay but support is awful.\n<|assistant|>\nThis review shows very negative sentiment (-0.50) with a 2/5 star rating."
  },
  {
    "text": "<|user|>\nAnalyze this product review: Perfect size and very comfortable to use. Great battery life too!\n<|assistant|>\nThis review shows very positive sentiment (0.80) with a 5/5 star rating."
  },
  {
    "text": "<|user|>\nWhat features does this review mention: Perfect size and very comfortable to use. Great battery life too!\n<|assistant|>\nThe review mentions size, battery. Overall sentiment is very positive with 5/5 stars."
  },
  {
    "text": "<|user|>\nAnalyze this product review: Too expensive for what you get. Quality is decent but overpriced.\n<|assistant|>\nThis review shows negative sentiment (-0.30) with a 3/5 star rating."
  },
  {
    "text": "<|user|>\nWhat features does this review mention: Too expensive for what you get. Quality is decent but overpriced.\n<|assistant|>\nThe review mentions quality, value. Overall sentiment is negative with 3/5 stars."
  }
]