{
  "model_type": "llama",
  "architectures": [
    "LlamaForCausalLM"
  ],
  "hidden_size": 2048,
  "num_attention_heads": 32,
  "num_hidden_layers": 22,
  "vocab_size": 32000,
  "torch_dtype": "float16",
  "transformers_version": "4.52.4",
  "fine_tuned": true,
  "lora_rank": 8,
  "lora_alpha": 16
}